xml/bin.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <BIN_SanalPos xmlns="https://turkpos.com.tr/">
            <G>
                <CLIENT_CODE>-CLIENT_CODE-</CLIENT_CODE>
                <CLIENT_USERNAME>-CLIENT_USERNAME-</CLIENT_USERNAME>
                <CLIENT_PASSWORD>-CLIENT_PASSWORD-</CLIENT_PASSWORD>
            </G>
            <BIN>-BIN-</BIN>;
        </BIN_SanalPos>;
    </soap:Body>
</soap:Envelope>