xml/installment.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> <soap:Body>
    <TP_Ozel_Oran_Liste xmlns="https://turkpos.com.tr/">
        <G>
            <CLIENT_CODE>-CLIENT_CODE-</CLIENT_CODE>
            <CLIENT_USERNAME>-CLIENT_USERNAME-</CLIENT_USERNAME>
            <CLIENT_PASSWORD>-CLIENT_PASSWORD-</CLIENT_PASSWORD>
        </G>
        <GUID>-GUID-</GUID>
    </TP_Ozel_Oran_Liste>
</soap:Body>
</soap:Envelope>